




const arrListPatrolFabuly = [


{ 
	id 		: 'kupap_122_2_pdr_8.7.3.e',
	//title 	: 'здійснив проїзд на червоний сигнал світлофора, чим порушив п.8.7.3.е ПДР, чим скоїв адміністративне правопорушення, передбачене ч.2 ст.122 КУпАП.', 
	title 	: '', 
	fabula 	: 'здійснив проїзд на червоний сигнал світлофора', 
	kupap 	: { id: '122_2', art: '122', part: '2', },
	//kupap 	: { art: '122p1', part: '2', }, // id == art + part
	pdr 	: [ '8.7.3.e', '8.7.3', '8.7', '8', ], // відобразити всі пункти з кінця
	img 	: 'traffic_light_red',
},




{ 
	id 		: 'kupap_121_1_pdr_31.4.3.в',
	title 	: '', 
	fabula 	: 'на якому не горіла лампа лівої фари в режимі ближнього світла, здійснював рух в темну пору доби', 
	kupap 	: { id: '121_1', art: '121', part: '1', },
	pdr 	: [ '31.4.3.в', '31.4.3', '31.4', '31', ],
	img 	: 'light_left_no',
},














];














/*
let objListAny = {};
arrListAny.forEach( k => {
	objListAny[ k.id ] = k;
});
*/






