




const arrListPatrolFabuly = [

/*
{ 
	id 		: 'traffic_light_red',
	//title 	: 'здійснив проїзд на червоний сигнал світлофора, чим порушив п.8.7.3.е ПДР, чим скоїв адміністративне правопорушення, передбачене ч.2 ст.122 КУпАП.', 
	title 	: '', 
	//offense : 'ючи',
	//offense : 'вав',

	fabula 	: 'здійснив рух на заборонений червоний сигнал світлофора', 
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '8.7.3.e', 	


	img 	: 'light_left_no', // якщо є - то картинка звідси, якщо нема - картинка з ID

},
*/











{ 
	id 		: 'traffic_light_red',
	title 	: '', 
	fabula 	: 'здійснив рух на заборонений червоний сигнал світлофора', 
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '8.7.3.e',
},
{ 
	id 		: 'traffic_light_yellow',
	title 	: '', 
	fabula 	: 'здійснив рух на заборонений жовтий сигнал світлофора', 
	kupap 	: { id: '122_2', art: '122', part: '2', },
	pdr 	: '8.7.3.ґ',
},






{ 
	id 		: 'sign_2.2',
	fabula 	: 'не виконав вимогу дорожнього знаку 2.2 «Проїзд без зупинки заборонено», здійснивши рух без зупинки', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.б',
},
{ 
	id 		: 'sign_3.1',
	fabula 	: 'не виконав вимогу дорожнього знаку 3.1 «Рух заборонено», здійснивши рух в зону дії знака', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
},
{ 
	id 		: 'sign_3.2',
	fabula 	: 'не виконав вимогу дорожнього знаку 3.2 «Рух механічних транспортних засобів заборонено», здійснивши рух в зону дії знака', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
},
{ 
	id 		: 'sign_3.21',
	fabula 	: 'не виконав вимогу дорожнього знаку 3.21 «В\'їзд заборонено», здійснивши рух в зону дії знака', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
},
{ 
	id 		: 'sign_3.34',
	fabula 	: 'здійснив зупинку в зоні дії дорожнього знаку 3.34 «Зупинку заборонено»', 
	kupap 	: { art: '122', part: '1', },
	pdr 	: '8.4.в',
},


















{ 
	id 		: 'light_left_no',
	fabula 	: 'на якому не горіла лампа лівої фари в режимі ближнього світла, здійснював рух в темну пору доби', 
	kupap 	: { id: '121_1', art: '121', part: '1', },
	pdr 	: '31.4.3.в',
},


















































];














/*
let objListAny = {};
arrListAny.forEach( k => {
	objListAny[ k.id ] = k;
});
*/






